Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::v1::RoutingNode Class Referencefinal
MEP Element Manager
The RoutingNode can contain Bend and Transition elements. More...
#include <MEPRoutingNode.hpp>
 Inheritance diagram for ACAPI::MEP::v1::RoutingNode:
 Public Member Functions
API_Coord3D  | GetPosition () const
std::optional< UniqueID >  | GetIncomingSegmentId () const
std::optional< UniqueID >  | GetOutgoingSegmentId () const
std::vector< UniqueID >  | GetBendIds () const
std::vector< UniqueID >  | GetTransitionIds () const
PreferredTransitionPlacement  | GetPreferredTransitionPlacement () const
UniqueID  | GetRoutingElementId () const
Domain  | GetDomain () const
RoutingNodeDefault  | PickUpDefault () const
Picks up and returns the Default of the RoutingNode.
TransitionDefault  | GetTransitionDefaultParameters () const
BendDefault  | GetBendDefaultParameters () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the given modifier scope in an Undoable command.
void  | SetPosition (const API_Coord3D &newPosition)
Sets a new position of the Routing Node.
void  | SetPreferredTransitionPlacement (PreferredTransitionPlacement preferredTransitionPlacement)
Sets the rule of the Bend-Transition placement order of the Routing Node.
Result< void >  | Inject (const RoutingNodeDefault &routingNodeDefault)
Injects the given Default settings to the RoutingNode.
Result< void >  | SetTransitionDefaultParameters (const TransitionDefault &transitionDefault)
Sets the parameters of the Transitions.
Result< void >  | SetBendDefaultParameters (const BendDefault &bendDefault)
Sets the parameters of the Bends.
 Static Public Member Functions
static Result< RoutingNode >  | Get (const UniqueID &uniqueId)
Returns a RoutingNode.
Detailed Description
The RoutingNode can contain Bend and Transition elements.
This type of element is placed in the corner points of RouteElement.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<RoutingNode> routingNode = RoutingNode::Get (id);
 if (routingNode.IsErr ()) {
 ACAPI_WriteReport (routingNode.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter routingNodeReporter (1);
 routingNodeReporter.Add ("Routing Node id", id);
 routingNodeReporter.SetTabCount (2);
 routingNodeReporter.Add ("tPosition", routingNode->GetPosition ());
 routingNodeReporter.Add ("Preferred Transition Placement", routingNode->GetPreferredTransitionPlacement ());
 std::optional<UniqueID> incomingSegmentId = routingNode->GetIncomingSegmentId ();
 incomingSegmentId.has_value () ? routingNodeReporter.Add ("Id of Incoming Segment", *incomingSegmentId) : routingNodeReporter.Add ("Does not have Incoming Segment.");
 std::optional<UniqueID> outgoingSegmentId = routingNode->GetOutgoingSegmentId ();
 outgoingSegmentId.has_value () ? routingNodeReporter.Add ("Id of Outgoing Segment", *outgoingSegmentId) : routingNodeReporter.Add ("Does not have Outgoing Segment.");
 routingNodeReporter.Write ();
 // Bends
 std::vector<UniqueID> bendIds = routingNode->GetBendIds ();
 if (!bendIds.empty ()) {
 ACAPI_WriteReport ("\t\tList of Bends:\n", false);
 for (const UniqueID& id : bendIds)
 WriteBendDetails (id);
 }
 // Transitions
 std::vector<UniqueID> transitionIds = routingNode->GetTransitionIds ();
 if (!transitionIds.empty ()) {
 ACAPI_WriteReport ("\t\tList of Transitions:\n", false);
 for (const UniqueID& id : transitionIds)
 WriteTransitionDetails (id);
 }
 Modification
 const API_Coord3D& currentPosition = routingNode.GetPosition ();
 ACAPI::Result<void> modifyResult = routingNode.Modify ([&](RoutingNode::Modifier& modifier) {
 API_Coord3D position (currentPosition);
 position.z += 5.0;
 modifier.SetPosition (position);
 }, "Elevate a Node of Routing Element.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 return NoError;
Member Function Documentation
◆ Get()
 static Result< RoutingNode > ACAPI::MEP::v1::RoutingNode::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a RoutingNode.
Parameters
uniqueId | The UniqueID of the requested RoutingNode.
Returns
If the uniqueId belongs to a RoutingNode, returns the object associated to it, otherwise Error.
◆ GetBendDefaultParameters()
 BendDefault ACAPI::MEP::v1::RoutingNode::GetBendDefaultParameters  |  ( |   | ) |   const
Returns
Returns the default parameters of the uncustomized Bends.
◆ GetBendIds()
 std::vector< UniqueID > ACAPI::MEP::v1::RoutingNode::GetBendIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the contained Bends.
◆ GetDomain()
 Domain ACAPI::MEP::v1::RoutingNode::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the RoutingNode.
◆ GetIncomingSegmentId()
 std::optional< UniqueID > ACAPI::MEP::v1::RoutingNode::GetIncomingSegmentId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the incoming segment if it has any.
◆ GetOutgoingSegmentId()
 std::optional< UniqueID > ACAPI::MEP::v1::RoutingNode::GetOutgoingSegmentId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the outgoing segment if it has any.
◆ GetPosition()
 API_Coord3D ACAPI::MEP::v1::RoutingNode::GetPosition  |  ( |   | ) |   const
Returns
Returns the position of the RoutingNode.
◆ GetPreferredTransitionPlacement()
 PreferredTransitionPlacement ACAPI::MEP::v1::RoutingNode::GetPreferredTransitionPlacement  |  ( |   | ) |   const
Returns
Returns the rule of the Bend-Transition placement order of the RoutingNode.
◆ GetRoutingElementId()
 UniqueID ACAPI::MEP::v1::RoutingNode::GetRoutingElementId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingElement that it belongs to.
◆ GetTransitionDefaultParameters()
 TransitionDefault ACAPI::MEP::v1::RoutingNode::GetTransitionDefaultParameters  |  ( |   | ) |   const
Returns
Returns the default parameters of the uncustomized Transitions.
◆ GetTransitionIds()
 std::vector< UniqueID > ACAPI::MEP::v1::RoutingNode::GetTransitionIds  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the contained Transitions.
◆ Inject()
 Result< void > ACAPI::MEP::v1::RoutingNode::Inject  |  ( |  const RoutingNodeDefault &  |  routingNodeDefault | )
Injects the given Default settings to the RoutingNode.
Parameters
routingNodeDefault | The Default which will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::RoutingNode::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the given modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 RoutingNodeDefault ACAPI::MEP::v1::RoutingNode::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the RoutingNode.
Returns
Returns a RoutingNodeDefault with the parameters of the object it was called for.
◆ SetBendDefaultParameters()
 Result< void > ACAPI::MEP::v1::RoutingNode::SetBendDefaultParameters  |  ( |  const BendDefault &  |  bendDefault | )
Sets the parameters of the Bends.
Parameters
bendDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.
◆ SetPosition()
 void ACAPI::MEP::v1::RoutingNode::SetPosition  |  ( |  const API_Coord3D &  |  newPosition | )
Sets a new position of the Routing Node.
Parameters
newPosition | The new position of the Routing Node.
◆ SetPreferredTransitionPlacement()
 void ACAPI::MEP::v1::RoutingNode::SetPreferredTransitionPlacement  |  ( |  PreferredTransitionPlacement  |  preferredTransitionPlacement | )
Sets the rule of the Bend-Transition placement order of the Routing Node.
Parameters
preferredTransitionPlacement | The rule to be set.
◆ SetTransitionDefaultParameters()
 Result< void > ACAPI::MEP::v1::RoutingNode::SetTransitionDefaultParameters  |  ( |  const TransitionDefault &  |  transitionDefault | )
Sets the parameters of the Transitions.
Parameters
transitionDefault | The Default to be set. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error in case of domain mismatch or if the set operation fails for some internal reason, otherwise nothing.